## Staging: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 9 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                 |
|--------|----------------------------------------------------------------------|
| add    | `aws_iam_role.forms_lambda_client`                                   |
|        | `aws_iam_role_policy_attachment.cognito_forms_lambda_client`         |
|        | `aws_iam_role_policy_attachment.dynamodb_forms_lambda_client`        |
|        | `aws_iam_role_policy_attachment.forms_lambda_client_vpc_access`      |
|        | `aws_iam_role_policy_attachment.kms_forms_lambda_client`             |
|        | `aws_iam_role_policy_attachment.s3_forms_lambda_client`              |
|        | `aws_iam_role_policy_attachment.secrets_manager_forms_lambda_client` |
|        | `aws_iam_role_policy_attachment.sqs_forms_lambda_client`             |
|        | `aws_lambda_permission.submission_lambda_invoke`                     |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.forms_lambda_client will be created
  + resource "aws_iam_role" "forms_lambda_client" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "forms-lambda-client"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.cognito_forms_lambda_client will be created
  + resource "aws_iam_role_policy_attachment" "cognito_forms_lambda_client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::687401027353:policy/cognito"
      + role       = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.dynamodb_forms_lambda_client will be created
  + resource "aws_iam_role_policy_attachment" "dynamodb_forms_lambda_client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::687401027353:policy/forms_dynamodb"
      + role       = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.forms_lambda_client_vpc_access will be created
  + resource "aws_iam_role_policy_attachment" "forms_lambda_client_vpc_access" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
      + role       = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.kms_forms_lambda_client will be created
  + resource "aws_iam_role_policy_attachment" "kms_forms_lambda_client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::687401027353:policy/ecs_kms"
      + role       = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.s3_forms_lambda_client will be created
  + resource "aws_iam_role_policy_attachment" "s3_forms_lambda_client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::687401027353:policy/formsS3Access"
      + role       = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.secrets_manager_forms_lambda_client will be created
  + resource "aws_iam_role_policy_attachment" "secrets_manager_forms_lambda_client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::687401027353:policy/formsSecretsManagerKeyRetrieval"
      + role       = "forms-lambda-client"
    }

  # aws_iam_role_policy_attachment.sqs_forms_lambda_client will be created
  + resource "aws_iam_role_policy_attachment" "sqs_forms_lambda_client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::687401027353:policy/forms_sqs"
      + role       = "forms-lambda-client"
    }

  # aws_lambda_permission.submission_lambda_invoke will be created
  + resource "aws_lambda_permission" "submission_lambda_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "Submission"
      + id                  = (known after apply)
      + principal           = (known after apply)
      + statement_id        = "AllowSubmissionInvokeFromFormsLambdaClient"
      + statement_id_prefix = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + forms_lambda_client_iam_role_name              = "forms-lambda-client"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.prisma_migration_handler"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
